#+TITLE: Doom Emacs Literate Config File
#+AUTHOR: Mitchell Bosley

** vulpea
#+begin_src emacs-lisp
(use-package vulpea
  :ensure t
  :hook ((org-roam-db-autosync-mode . vulpea-db-autosync-enable))
;;   :config
;;   (setq org-agenda-prefix-format
;;         '((agenda . " %i %(vulpea-agenda-category 12)%?-12t% s")
;;           (todo . " %i %(vulpea-agenda-category 12) ")
;;           (tags . " %i %(vulpea-agenda-category 12) ")
;;           (search . " %i %(vaulpea-agenda-category 12) ")))

;;   (defun vulpea-agenda-category (&optional len)
;;     "Get category of item at point for agenda.

;; Category is defined by one of the following items:

;; - CATEGORY property
;; - TITLE keyword
;; - TITLE property
;; - filename without directory and extension

;; When LEN is a number, resulting string is padded right with
;; spaces and then truncated with ... on the right if result is
;; longer than LEN.

;; Usage example:

;;   (setq org-agenda-prefix-format
;;         '((agenda . \" %(vulpea-agenda-category) %?-12t %12s\")))

;; Refer to `org-agenda-prefix-format' for more information."
;;     (let* ((file-name (when buffer-file-name
;;                         (file-name-sans-extension
;;                          (file-name-nondirectory buffer-file-name))))
;;            (title (vulpea-buffer-prop-get "title"))
;;            (category (org-get-category))
;;            (result
;;             (or (if (and
;;                      title
;;                      (string-equal category file-name))
;;                     title
;;                   category)
;;                 "")))
;;       (if (numberp len)
;;           (s-truncate len (s-pad-right len " " result))
;;         result)))
  )
#+end_src

#+RESULTS:
| vulpea-db-autosync-enable |

*** julia
#+BEGIN_SRC emacs-lisp
(use-package lsp-julia
  :config
  (setq lsp-julia-default-environment "~/.julia/environments/v1.5")
  ;; (setq lsp-julia-package-dir nil))
  (setq lsp-enable-folding t)
  ;; (setq lsp-julia-package-dir "~/.emacs.d/.local/straight/repos/lsp-julia/languageserver")
  ;; (require 'lsp-julia)
  (add-hook 'ess-julia-mode-hook #'lsp-mode))
#+END_SRC

#+RESULTS:
: ~/.julia/environments/v1.5
